{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bb47e280-d081-4c17-a995-5497e1d8d1c3')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bb47e280-d081-4c17-a995-5497e1d8d1c3')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-11-01-preview",
            "properties": {
                "displayName": "Detection of Malware in a Storage Account",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "SecurityAlert\n| where AlertName contains \"Malware\"\n| where CompromisedEntity == \"jmdstorageaccount\"\n| project CompromisedEntity, parse_json(ExtendedProperties).Container, ResourceId, parse_json(tostring(parse_json(Entities)[1].SourceAddress)).Address, parse_json(tostring(parse_json(tostring(parse_json(Entities)[3].Files))[0].FileHashes))[0].Type, parse_json(tostring(parse_json(tostring(parse_json(Entities)[3].Files))[0].FileHashes))[0].Value, parse_json(tostring(parse_json(Entities)[3].Files))[0].Name\n| extend SourceIP = Entities_1_SourceAddress_Address, FileHashType = Entities_3_Files_0_FileHashes_0_Type, FileHashValue = Entities_3_Files_0_FileHashes_0_Value, FileName = Entities_3_Files_0_Name, ContainerName = ExtendedProperties_Container",
                "queryFrequency": "PT3H",
                "queryPeriod": "P3D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "ResourceDevelopment"
                ],
                "techniques": [
                    "T1584"
                ],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "FileName"
                            }
                        ]
                    },
                    {
                        "entityType": "AzureResource",
                        "fieldMappings": [
                            {
                                "identifier": "ResourceId",
                                "columnName": "ResourceId"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "SourceIP"
                            }
                        ]
                    },
                    {
                        "entityType": "FileHash",
                        "fieldMappings": [
                            {
                                "identifier": "Value",
                                "columnName": "FileHashValue"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
